project/integrations/KNX_CREATE_CONTACT_01.00.0000/resources/application_117/inbound_118/resourcegroup_119/findCustomerAccount_REQUEST_RT.wsdl

<wsdl:definitions         targetNamespace="http://xmlns.oracle.com/cloud/adapter/erp/findCustomerAccount_REQUEST"     xmlns:plnk="http://schemas.xmlsoap.org/ws/2003/05/partner-link/"     xmlns:errors="http://xmlns.oracle.com/adf/svc/errors/"     xmlns:orafault="http://xmlns.oracle.com/oracleas/schema/oracle-fault-11_0"     xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"     xmlns:tns="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/"     xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"     xmlns:types="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/"     xmlns:ns0="http://xmlns.oracle.com/cloud/adapter/erp/findCustomerAccount_REQUEST/types"     xmlns:ns1="http://xmlns.oracle.com/cloud/adapter/erp/findCustomerAccount_REQUEST"    >    <casdk:RuntimeIntegrationModel xmlns:casdk="http://xml.oracle.com/wsdl/extensions">        <casdk:sourceWSDLMetadata>            <casdk:serviceName>{http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/}CustomerAccountService</casdk:serviceName>            <casdk:portTypeName>{http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/}CustomerAccountService</casdk:portTypeName>            <casdk:portName>CustomerAccountServiceSoapHttpPort</casdk:portName>            <casdk:endpointURL>ENDPOINT_URL</casdk:endpointURL>            <casdk:targetWSDLNS>http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/</casdk:targetWSDLNS>            <casdk:soapVersion>SOAP11</casdk:soapVersion>        </casdk:sourceWSDLMetadata>    </casdk:RuntimeIntegrationModel>    <plnk:partnerLinkType name="findCustomerAccount_plt">        <plnk:role name="findCustomerAccount_role">            <plnk:portType name="ns1:findCustomerAccount_REQUESTPortType"/>        </plnk:role>    </plnk:partnerLinkType>    <wsdl:types>        <xs:schema xmlns="http://xmlns.oracle.com/cloud/adapter/erp/findCustomerAccount_REQUEST/types"             elementFormDefault="qualified" xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://xmlns.oracle.com/cloud/adapter/erp/findCustomerAccount_REQUEST/types">            <xs:element name="findCustomerAccount" type="xs:anyType"/>            <xs:element name="findCustomerAccountResponse" type="xs:anyType"/>        </xs:schema>        <xs:schema xmlns="http://xmlns.oracle.com/adf/svc/errors/" elementFormDefault="qualified"             xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://xmlns.oracle.com/adf/svc/errors/">            <xs:element name="ServiceErrorMessage" type="xs:anyType"/>        </xs:schema>    </wsdl:types>    <wsdl:message name="findCustomerAccountRequestMessage">        <wsdl:part name="parameters" element="ns0:findCustomerAccount"/>    </wsdl:message>    <wsdl:message name="findCustomerAccountResponseMessage">        <wsdl:part name="parameters" element="ns0:findCustomerAccountResponse"/>    </wsdl:message>    <wsdl:message name="ServiceException">        <wsdl:part name="parameters" element="errors:ServiceErrorMessage"/>    </wsdl:message>    <wsdl:portType name="findCustomerAccount_REQUESTPortType">        <wsdl:operation name="findCustomerAccount">            <cloud:CloudOperation xmlns:cloud="http://xml.oracle.com/types" targetOperation="findCustomerAccount"/>            <wsdl:input message="ns1:findCustomerAccountRequestMessage"/>            <wsdl:output message="ns1:findCustomerAccountResponseMessage"/>            <wsdl:fault name="ServiceException" message="ns1:ServiceException"/>        </wsdl:operation>    </wsdl:portType></wsdl:definitions>