CPQ Integration Doc/customerAccountPayload.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/" xmlns:typ1="http://xmlns.oracle.com/adf/svc/types/"> 
   <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsu:Timestamp wsu:Id="TS-2">
            <wsu:Created>{{UTCTIME}}</wsu:Created>
         </wsu:Timestamp>
         <wsse:UsernameToken>
            <wsse:Username>{{USERNAME}}</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{PASSWORD}}</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
<soapenv:Body> 
<typ:findCustomerAccount> 
<typ:findCriteria> 
<typ1:fetchStart>0</typ1:fetchStart> 
<typ1:fetchSize>-1</typ1:fetchSize> 
<typ1:filter> 
<typ1:conjunction/> 
<typ1:group> 
<typ1:conjunction/> 
<typ1:item> 
<typ1:conjunction/> 
<typ1:upperCaseCompare>false</typ1:upperCaseCompare> 
<typ1:attribute>PartyId</typ1:attribute> 
<typ1:operator>=</typ1:operator> 
<typ1:value>{{returnPartyId}}</typ1:value> 
</typ1:item> 

<typ1:item> 
<typ1:conjunction/> 
<typ1:upperCaseCompare>false</typ1:upperCaseCompare> 
 <typ1:attribute>Status</typ1:attribute>
<typ1:operator>=</typ1:operator>
<typ1:value>A</typ1:value>
</typ1:item>

</typ1:group> 


<typ1:nested/> 
</typ1:filter> 
<typ1:findAttribute>CustomerAccountId</typ1:findAttribute>
 <typ1:findAttribute>PartyId</typ1:findAttribute>
 <typ1:findAttribute>LastUpdateDate</typ1:findAttribute>
  <typ1:findAttribute>AccountNumber</typ1:findAttribute>
  <typ1:findAttribute>LastUpdatedBy</typ1:findAttribute>
   <typ1:findAttribute>CreationDate</typ1:findAttribute>
  <typ1:findAttribute>CreatedBy</typ1:findAttribute>
  <typ1:findAttribute>LastUpdateLogin</typ1:findAttribute>
  <typ1:findAttribute>OrigSystemReference</typ1:findAttribute>
 <typ1:findAttribute>Status</typ1:findAttribute>
 <typ1:findAttribute>AccountEstablishedDate</typ1:findAttribute>
  <typ1:findAttribute>AccountTerminationDate</typ1:findAttribute>
  <typ1:findAttribute>AccountName</typ1:findAttribute>
  <typ1:findAttribute>CreatedByModule</typ1:findAttribute>        
<typ1:findAttribute>CustomerAccountSite</typ1:findAttribute> 
<typ1:excludeAttribute>false</typ1:excludeAttribute> 
<typ1:childFindCriteria> 
<typ1:fetchStart>0</typ1:fetchStart> 
<typ1:fetchSize>-1</typ1:fetchSize> 
<typ1:filter> 
<typ1:group> 
<typ1:upperCaseCompare>false</typ1:upperCaseCompare> 
<typ1:item> 
<typ1:upperCaseCompare>false</typ1:upperCaseCompare> 
<typ1:attribute>Status</typ1:attribute> 
<typ1:operator>=</typ1:operator> 
<typ1:value>A</typ1:value> 
</typ1:item> 
</typ1:group> 
</typ1:filter> 
<typ1:childFindCriteria/> 
<typ1:childAttrName>CustomerAccountSite</typ1:childAttrName> 
<typ1:childFindCriteria> 
<typ1:fetchStart>0</typ1:fetchStart> 
<typ1:fetchSize>-1</typ1:fetchSize> 
<typ1:filter> 
<typ1:group> 
<typ1:upperCaseCompare>false</typ1:upperCaseCompare> 
<typ1:item> 
<typ1:upperCaseCompare>false</typ1:upperCaseCompare> 
<typ1:attribute>Status</typ1:attribute> 
<typ1:operator>=</typ1:operator> 
<typ1:value>A</typ1:value> 
</typ1:item> 
</typ1:group> 
</typ1:filter> 
<typ1:childFindCriteria/> 
<typ1:childAttrName>CustomerAccountSiteUse</typ1:childAttrName> 
</typ1:childFindCriteria> 
</typ1:childFindCriteria> 
</typ:findCriteria> 
<typ:findControl> 
<typ1:retrieveAllTranslations>false</typ1:retrieveAllTranslations> 
</typ:findControl> 
</typ:findCustomerAccount> 
</soapenv:Body> 
</soapenv:Envelope> 
